In [1]:
import numpy as np
import pandas as pd

In [6]:
labels =  ["a","b","c"]
ls = [10,20,30]
arr =  np.array(ls)

d = {"a":10,"b":20,"c":30}

In [7]:
arr

array([10, 20, 30])

In [8]:
d

{'a': 10, 'b': 20, 'c': 30}

In [13]:
# Creating a Series from a python list
pd.Series(data=ls)

0    10
1    20
2    30
dtype: int64

In [14]:
# Creating a series from a numpy array with labels
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [15]:
# Creating a series from a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
ser1   = pd.Series([1,2,3,4],['USA','SL','UK','RW'])

In [17]:
ser1

USA    1
SL     2
UK     3
RW     4
dtype: int64

In [18]:
ser1['USA']

1

In [20]:
ser1.loc['SL']

2

### Working with DataFrames

In [23]:
np.random.seed(13111992)

In [33]:
# We have generated some fake data
cols  = ['age','salary']
data =  np.random.randint(1,100,200).reshape(100,2)
df  =  pd.DataFrame(data= data,columns=cols);

In [34]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
age,49,98,1,46,82,41,35,54,65,9,...,67,56,17,72,90,62,49,37,49,74
salary,19,87,40,39,97,23,24,92,69,43,...,6,74,35,41,93,99,41,17,60,18

In [58]:
df.head()

   age  salary
0   49      19
1   98      87
2    1      40
3   46      39
4   82      97

In [59]:
df.tail()

    age  salary
95   62      99
96   49      41
97   37      17
98   49      60
99   74      18

In [67]:
# adding new column
df['new'] =  (df['age'] +  df['salary'])/2

In [61]:
df

    age  salary   new
0    49      19  34.0
1    98      87  92.5
2     1      40  20.5
3    46      39  42.5
4    82      97  89.5
..  ...     ...   ...
95   62      99  80.5
96   49      41  45.0
97   37      17  27.0
98   49      60  54.5
99   74      18  46.0

[100 rows x 3 columns]

In [72]:
# dropping a column
df.drop('new',axis=1,inplace=True)

In [73]:
df

    age  salary
0    49      19
1    98      87
2     1      40
3    46      39
4    82      97
..  ...     ...
95   62      99
96   49      41
97   37      17
98   49      60
99   74      18

[100 rows x 2 columns]

In [70]:
# Selecting rows in a dataframe
df.iloc[0:10]

   age  salary   new
0   49      19  34.0
1   98      87  92.5
2    1      40  20.5
3   46      39  42.5
4   82      97  89.5
5   41      23  32.0
6   35      24  29.5
7   54      92  73.0
8   65      69  67.0
9    9      43  26.0

In [76]:
# Selecting subsets of rows and columns

df.iloc[0:5,0:]

   age  salary
0   49      19
1   98      87
2    1      40
3   46      39
4   82      97

In [77]:
df.shape

(100, 2)

In [79]:
# Saving our dataframe to csv
df.to_csv('salary.csv')

In [83]:
# Using conditional selections

df[df>50]

     age  salary
0    NaN     NaN
1   98.0    87.0
2    NaN     NaN
3    NaN     NaN
4   82.0    97.0
..   ...     ...
95  62.0    99.0
96   NaN     NaN
97   NaN     NaN
98   NaN    60.0
99  74.0     NaN

[100 rows x 2 columns]

In [91]:
# using logical connective and
df[(df['salary'] > 90) & (df['age'] < 50)]

    age  salary
22   13      97
28   19      93
42   34      94
44   40      93
67   36      98

In [95]:
# using logical or 
df[(df['salary'] < 20) | (df['age'] > 90)]

    age  salary
0    49      19
1    98      87
30    1       6
46   47      13
51   58       8
52    5      10
57   91       7
58   48      11
69   92      33
70   94      38
73   97      19
74   79       6
75   97      69
78   82       4
80   85      12
81   92       9
82   67       1
87   96      74
90   67       6
97   37      17
99   74      18

In [97]:
# resetting the dataframe index

df.reset_index(inplace=True)

In [105]:
df.drop('index',axis=1,inplace=True)

In [106]:
df

    age  salary
0    49      19
1    98      87
2     1      40
3    46      39
4    82      97
..  ...     ...
95   62      99
96   49      41
97   37      17
98   49      60
99   74      18

[100 rows x 2 columns]

In [107]:
# Multi-level indexing
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
higher_ind =  list(zip(outside,inside))

In [112]:
pd_higher_index =  pd.MultiIndex.from_tuples(higher_ind)

In [113]:
pd_higher_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [116]:
df =  pd.DataFrame(np.random.randn(6,2),pd_higher_index,['A','B'])

In [119]:
df

             A         B
G1 1  0.413213 -2.108611
   2  0.218137 -1.285974
   3 -0.489114  1.881595
G2 1 -0.606482 -0.287339
   2  1.349671  0.289145
   3 -0.715189 -1.041994

In [121]:
# Index hierarchy
df.loc['G1']

          A         B
1  0.413213 -2.108611
2  0.218137 -1.285974
3 -0.489114  1.881595

In [124]:
df.index.names = ["Groups","Num"]

In [125]:
df

                   A         B
Groups Num
G1     1    0.413213 -2.108611
       2    0.218137 -1.285974
       3   -0.489114  1.881595
G2     1   -0.606482 -0.287339
       2    1.349671  0.289145
       3   -0.715189 -1.041994

In [127]:
# Dataframe aggregation
df.xs(1,level='Num')

               A         B
Groups
G1      0.413213 -2.108611
G2     -0.606482 -0.287339

In [133]:
# Missing Data

d = {"A":[9,2,np.nan],"B":[5,np.nan,np.nan],"C":[2,1,4]}
df = pd.DataFrame(d)

In [134]:
df

     A    B  C
0  9.0  5.0  2
1  2.0  NaN  1
2  NaN  NaN  4

In [135]:
# dropping na rows

df.dropna()

     A    B  C
0  9.0  5.0  2

In [137]:
# droppping na columns

df.dropna(axis=1)

   C
0  2
1  1
2  4

In [138]:
df

     A    B  C
0  9.0  5.0  2
1  2.0  NaN  1
2  NaN  NaN  4

In [141]:
# setting the threshold for the number of fields
df.dropna(thresh=2)

     A    B  C
0  9.0  5.0  2
1  2.0  NaN  1

In [142]:
df.dropna(axis= 1,thresh=2)

     A  C
0  9.0  2
1  2.0  1
2  NaN  4

In [143]:
# filling the missing values

df.fillna(value='hello')

       A      B  C
0      9      5  2
1      2  hello  1
2  hello  hello  4

In [147]:
df.fillna(value=df.mean().mean())

          A         B  C
0  9.000000  5.000000  2
1  2.000000  4.277778  1
2  4.277778  4.277778  4

4.277777777777778